import 'package:sqflite/sqflite.dart';
import 'package:collection/collection.dart';
import 'package:path/path.dart';

class Database_ {
  // Get a location using getDatabasesPath

  List<Map> greetingDetails;

  Future<void> Initialise() async {
    var databasesPath = await getDatabasesPath();
    String path = join(databasesPath, 'demo.db');

    // open the database
    Database database = await openDatabase(path, version: 1,
        onCreate: (Database db, int version) async {
      // When creating the db, create the table
      await db.execute("""
         CREATE TABLE Greeting_Details
(
     Sub_ID 	TEXT,
     Sequence 	TEXT,
     Sentence 	TEXT
);

INSERT INTO Greeting_Details ( Sub_ID , Sequence , Sentence )
VALUES
    ('1', '1', '夏之清晨，'),
    ('1', '2', '晨之问候,'),
    ('1', '3', '祝你天天都顺意'),
    ('2', '1', '希望你度过美好的一天！'),
    ('3', '1', '愿一个问候带给你一个新的心情，'),
    ('3', '2', '愿一个祝福带给你一个新的起点。'),
    ('4', '1', '点点心意点点情，'),
    ('4', '2', '短信声声传真情，'),
    ('4', '3', '祝福问候送不停,'),
    ('4', '4', '愿你天天好心情!'),
    ('5', '1', '祝你天天开心! '),
    ('5', '2', '顺心! 舒心！'),
    ('6', '1', '一个小小的问候,'),
    ('6', '2', '一份深深的怀念！'),
    ('6', '3', '一片浓浓的情意,'),
    ('6', '4', '一次甜甜的回忆!'),
    ('7', '1', '人的一生也正如太阳的一天。'),
    ('7', '2', '早晨为人们带来曙光'),
    ('8', '1', '祝您健康到永远, '),
    ('8', '2', '开心永不止! '),
    ('9', '1', '新的一天清晨，'),
    ('9', '2', '温馨一声问候，'),
    ('9', '3', '早上好！'),
    ('10', '1', '睡去昨天的疲惫，'),
    ('10', '2', '忘却昨天的烦恼，'),
    ('10', '3', '睁开今天的双眼，'),
    ('10', '4', '打开今天的美好。'),
    ('10', '5', '早上好!'),
    ('11', '1', '新的一天努力吧，'),
    ('11', '2', '爱自己，加油！'),
    ('12', '1', '给自己一个肯定的微笑，'),
    ('12', '2', '新的一天努力吧!'),
    ('13', '1', '不是每天都有阳光，'),
    ('13', '2', '不是每天都会凉爽，'),
    ('13', '3', '只要我们心中有阳光，'),
    ('13', '4', '每天都会充满希望！'),
    ('14', '1', '睁开眼，缓一缓；'),
    ('14', '2', '快起床，伸懒腰；'),
    ('14', '3', '笑一笑，美好的一天又开始了！'),
    ('15', '1', '善良的人总是幸福，'),
    ('15', '2', '知足的人永远快乐！'),
    ('16', '1', '寄一支玫瑰，给你送去芬芳'),
    ('17', '1', '祝你甜甜蜜蜜，'),
    ('17', '2', '开开心心，快快乐乐，'),
    ('17', '3', '健健康康，平平安安!'),
    ('18', '1', '愿你每天都健康开心!'),
    ('19', '1', '祝你一天幸福乐逍遥。'),
    ('20', '1', '珍惜时光的一分一秒，就是快乐！'),
    ('21', '1', '珍爱身边的人和事，就是幸福的！'),
    ('22', '1', '笑是一生，哭是一生。'),
    ('22', '2', '我们倒不如每天给自己一个希望，'),
    ('22', '3', '每天给自己一份快乐的心情！');
         """);

      print("DB created");
    });
  }



}
